code/openfoam/tutorials/compressibleVoF/climbingRod/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha)  Gauss interfaceCompression vanLeer 1;

    div(rhoPhi,U)   Gauss linearUpwindV grad(U);

    div(alphaRhoPhi,e) Gauss linearUpwind grad(e);
    div(alphaRhoPhi,T) Gauss upwind;

    div(phi,p)      Gauss upwind;
    div(rhoPhi,K)   Gauss upwind;

    div(alphaRhoPhi.liquid,sigma.liquid) Gauss linearUpwind grad(sigma);

    div(alpha.liquid*rho.liquid*sigma.liquid)   Gauss linear;
    div(alpha.liquid*rho.liquid*nuM*grad(U))   Gauss linear;
    div(alpha.liquid*rho.liquid*mu.liquid|rho.liquid*dev2(T(grad(U)))) Gauss linear;

    div(alpha.air*rho.air*nuEff.air*dev2(T(grad(U)))) Gauss linear;
    div(alpha.liquid*rho.liquid*nuEff.liquid*dev2(T(grad(U)))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
